{
  "Hi, I am": "Hi, I am",
  "Dmitriy Khoperskiy": "Dmitriy Khoperskiy",
  "Front-end Developer": "Front-end Developer",
  "Dmitriy": "Dmitriy",
  "years old": "years old",
  "aboutMeInfo": "Front-end Developer. I have almost 4 years of commercial development experience. Started learning programming since I was in school. I have a higher technical education in the direction of \"Applied Computer Science\". In my spare time I go in for sports and play Counter Strike.",
  "Decent knowledge": "Decent knowledge",
  "Used a little": "Used a little",
  "Education": "Education",
  "Work experience": "Work experience",
  "School No. 1319": "School No. 1319",
  "School No. 1319, with in-depth study of English": "School No. 1319, with in-depth study of English",
  "Bachelor": "Bachelor",
  "Master": "Master",
  "Financial University under the Government of the Russian Federation": "Financial University under the Government of the Russian Federation",
  "Faculty of Information Technology and Big Data Analysis": "Faculty of Information Technology and Big Data Analysis",
  "Applied Computer Science": "Applied Computer Science",
  "intlDateTime": "{{val, datetime}}",
  "Present": "Present",
  "DevOps Engineering": "DevOps Engineering",
  "Freelance": "Freelance",
  "freelanceDescription": "Landing pages development based on layouts from Figma and Photoshop. Working with native JS, no frameworks",
  "Gusi-Lebedi": "Gusi-Lebedi",
  "gusiDescription": "Web-applications development from scratch in team. Worked according to layouts from Figma, interaction with the API, created and managed the state. Worked with simple and complex animations",
  "Xsolla": "Xsolla",
  "xsollaDescription": "Support for big Web-applications. Working with legacy code. Implementation of new functionality, bug fixes, code review",
  "Inmar Technologies": "Inmar Technologies",
  "Projects": "Projects",
  "Live demo": "Live demo",
  "Solar System": "Solar System",
  "React + Three.js project to create Solar System prototype": "React + Three.js project to create Solar System prototype",
  "Flights monitoring": "Flights monitoring",
  "React + OpenLayers Web-application to monitor flights in real time": "React + OpenLayers Web-application to monitor flights in real time",
  "Richbee Shows": "Richbee Shows",
  "React app using IMDb API to find info about films or series": "React app using IMDb API to find info about films or series",
  "IT’s Tinkoff Solution Cup": "IT’s Tinkoff Solution Cup",
  "Expense tracker Web-application, developed in the IT’s Tinkoff Solution Cup final": "Expense tracker Web-application, developed in the IT’s Tinkoff Solution Cup final",
  "About project": "About project",
  "Tech stack": "Tech stack",
  "Source code": "Source code",
  "solarSystemDescription": "<p>This web-application was built due to my interest in 3D-websites. I always adored 3D-animations on websites and thought that they are extremely hard to develop.</p><p>I chose the most popular 3D library for Web development - Three.js. Also I admire anything connected with space, planets and stars. So I decided to build my own prototype of Solar System.</p><p>This prototype contains Sun, the Asteroid belt and every planet up to Jupiter (because after that I was interrupted by some other project). Planet sizes proportions are close to real ones. Planets' speed around theirs axes and around sun are also close to the truth. Sun size made a lot smaller on purpose.</p>",
  "flightsMonitoringDescription": "<p>This Web-application was made as a part of my graduate work. The topic was \"Aircrafts' position visualization based on satellite monitoring data (Web-application)\". This topic seemed to me really fun and interesting so I decided to pick it.</p><p>The app uses OpenLayers JavaScript map library. For flights data I used OpenSky Network API  and AeroDataBox API. Due to limited requests, some part of information provided by AeroDataBox was mocked. There're some features as clusterization, dark theme mode and filters for better performance and user expreinece. The planes' position is updated every 5 seconds.</p>",
  "solutionCupDescription": "<p>On April 15, 2023, the qualifying round of IT's Tinkoff Solution Cup was held. Almost 4000 developers from all across Russia took part in that competition. I successfully passed the qualifying round and turned to be one of 330 finalists.</p><p>In the final we were given the task to create Web-application to account incomes and expenses. There were almost no technical requirements, so there was a room for creativity. We had 4,5 hours to develop the application. After the time was up, we went for a dinner, while the judges were rating our works.</p><p>I took seventh place in the tournament and was awarded for implementing the dark mode in my application. There're some minor bugs in the application, but I decided to leave the app in its original state.</p>",
  "richbeeDescription": "<p>One of the test tasks for some company. Nothing unusual, a simple, cute website for finding information about movies and TV shows using the IMDB API.</p><p>From what I like, it's a simple, but very pleasant animation when you hover over the suggested movie. Also, the animated background looks very nice, with a selection of trailers of different films.</p><p>The loading may take some time, since the background video is loaded from YouTube. Please be patient if you want to see this beauty.</p><p>If you are bored, you can scan this QR-code:</p>",
  "Social network": "Social network",
  "Fullstack client-server web-application for messaging with friends": "Fullstack client-server web-application for messaging with friends",
  "To be developed ...": "To be developed ...",
  "Add other projects": "Add other projects",
  "Responsive design for small devices": "Responsive design for small devices",
  "Reduce bundle size (currently 5MB of react-icons are loaded)": "Reduce bundle size (currently 5MB of react-icons are loaded)",
  "Add some animations": "Add some animations"
}