{
  "Hi, I am": "Привет, меня зовут",
  "Dmitriy Khoperskiy": "Дмитрий Хопёрский",
  "Front-end Developer": "Фронтенд Разработчик",
  "Dmitriy": "Дима",
  "years old": "{{label}}",
  "aboutMeInfo": "Фронтенд Разработчик. Имею почти 5 лет опыта коммерческой разработки. Начал изучать программирование со школы. Имею высшее техническое образование по направлению «Прикладная информатика». В свободное время занимаюсь спортом и играю в Counter Strike.",
  "Decent knowledge": "Уверенные знания",
  "Used a little": "Немного использовал",
  "Education": "Образование",
  "Work experience": "Опыт работы",
  "School No. 1319": "Школа № 1319",
  "School No. 1319, with in-depth study of English": "Школа № 1319, с углубленным изучением английского языка",
  "Bachelor": "Бакалавриат",
  "Master": "Магистратура",
  "Financial University under the Government of the Russian Federation": "Финансовый университет при Правительстве Российской Федерации",
  "Faculty of Information Technology and Big Data Analysis": "Факультет Информационных технологий и Анализа Больших Данных",
  "Applied Computer Science": "Прикладная Информатика",
  "Present": "по н.в.",
  "DevOps Engineering": "DevOps-инженерия",
  "Freelance": "Фриланс",
  "freelanceDescription": "Создание лендинг страниц по макетам из Figma и Photoshop. Работа с нативным JS, без фреймворков",
  "Gusi-Lebedi": "Гуси-Лебеди",
  "gusiDescription": "Создание Веб-приложений с нуля, работа в команде. Верстка по макетам из Figma, взаимодействие с API, работа со стейтом. Работа с простой и сложной анимацией. Поддержка крупных Веб-приложений . Работа с legacy кодом. Внедрение нового функционала, исправление багов, code review",
  "Xsolla": "Xsolla",
  "xsollaDescription": "Разработка интернет-магазинов для игр. Работа в команде. Code review",
  "Inmar Technologies": "Инмар Технолоджис",
  "inmarDescription": "Редизайн почтового клиента, работа с кодом 10-летней давности. Разработка внутреннего UI-Kit. Работа с большими формами",
  "Projects": "Проекты",
  "Live demo": "Живая демонстрация",
  "Solar System": "Солнечная Система",
  "React + Three.js project to create Solar System prototype": "Прототип Солнечной Системы на React + Three.js",
  "Flights monitoring": "Мониторинг полетов",
  "React + OpenLayers Web-application to monitor flights in real time": "Веб-приложение для отслеживания полетов в режиме реального времени на React + OpenLayers",
  "Richbee Shows": "Richbee Shows",
  "React app using IMDb API to find info about films or series": "React приложение, использующее IMDb API для поиска информации о фильмах или сериалах",
  "IT’s Tinkoff Solution Cup": "IT’s Tinkoff Solution Cup",
  "Expense tracker Web-application, developed in the IT’s Tinkoff Solution Cup final": "Веб-приложение для учета расходов, разработанное в рамках финала IT’s Tinkoff Solution Cup",
  "About project": "О проекте",
  "Tech stack": "Технологический стек",
  "Source code": "Исходный код",
  "solarSystemDescription": "<p>Это веб-приложение было создано из-за моему интереса к 3D-сайтам. Мне всегда нравилась 3D-анимация на сайтах, и я считал, что ее чрезвычайно сложно разрабатывать.</p><p>Я выбрал самую популярную 3D-библиотеку для веб-разработки — Three.js. Также я восхищаюсь всем, что связано с космосом, планетами и звездами. Поэтому я решил построить свой собственный прототип Солнечной системы.</p><p>Этот прототип содержит Солнце, пояс астероидов и все планеты до Юпитера (потому что после этого меня прервал какой-то другой проект). Пропорции размеров планет приближены к реальным. Скорость планет вокруг своей оси и вокруг Солнца также близка к истине. Размер Солнца специально сделан намного меньше.</p>",
  "flightsMonitoringDescription": "<p>Это Веб-приложение было создано как часть моей дипломной работы. Тема работы была \"Визуализация положения самолетов на основе данных спутникового мониторинга (Web-приложение)\". Эта тема показалась мне интересной и забавной, поэтому я решил выбрать ее.</p><p>Приложение использует библиотеку карт JavaScript OpenLayers. Для получения данных о рейсах я использовал API от OpenSky Network и AeroDataBox. Из-за ограниченного количества запросов некоторая часть информации, предоставленной AeroDataBox, была замокана. Есть некоторые функции, такие как кластеризация, режим темной темы и фильтры для повышения производительности и улучшения пользовательского опыта. Положение самолетов обновляется каждые 5 секунд.</p>",
  "solutionCupDescription": "<p>15 апреля 2023 года состоялся отборочный раунд IT's Tinkoff Solution Cup. В этом конкурсе приняли участие почти 4000 разработчиков со всей России. Я успешно прошел отборочный тур и оказался одним из 330 финалистов.</p><p>В финале нам было дано задание создать веб-приложение для учета доходов и расходов. Технических требований практически не было, так что был простор для творчества. На разработку приложения у нас было 4,5 часа. По истечении времени мы отправились на ужин, пока судьи оценивали наши работы.</p><p>Я занял седьмое место в турнире и был награжден за внедрение темной темы в моем приложении. В приложении есть несколько маленьких багов, но я решил оставить приложение в его первоначальном состоянии.</p>",
  "richbeeDescription": "<p>Одно из тестовых заданий для какой-то компании. Ничего необычного, простой симпатичный сайт для поиска информации о фильмах и сериалах с помощью IMDB API.</p><p>Из того что мне нравится, так это простая, но очень приятная анимация при наведении на предложенный фильм. Также, очень красиво выглядит анимированный фон с подборкой трейлеров разных фильмов.</p><p>Загрузка может занять какое-то время, так как фоновое видео подгружается с YouTube. Пожалуйста, наберитесь терпения, если хотите увидеть эту красоту.</p><p>Если вы заскучали, можете отсканировать этот QR-код:</p>",
  "Social network": "Социальная сеть",
  "Fullstack client-server web-application for messaging with friends": "Фуллстэк клиент-серверное веб-приложение для обмена сообщениями с друзьями",
  "To be developed ...": "Осталось доделать ...",
  "Add other projects": "Добавить остальные проекты",
  "Responsive design for small devices": "Адаптивный дизайн для маленьких устройств",
  "Reduce bundle size (currently 5MB of react-icons are loaded)": "Уменьшить размер сборки (в данный момент подгружается 5MB иконок react-icons)",
  "Add some animations": "Добавить анимации",
  "About me": "Обо мне",
  "year1": "год",
  "year2": "года",
  "year3": "лет",
  "month1": "месяц",
  "month2": "месяца",
  "month3": "месяцев"
}